using System;
using System.Collections.Generic;
using System.Linq;
using System.Reflection;
using CalamityRuTranslate.Common;
using CalamityRuTranslate.Common.Utilities;
using CalamityRuTranslate.Core.Config;
using CalamityRuTranslate.Core.ItemGenderPrefixes;
using CalamityRuTranslate.Core.MonoMod;
using PathOfTerraria.Core.Items;
using Terraria;
using Terraria.Localization;

namespace CalamityRuTranslate.Mods.PathOfTerraria.MonoMod;

public class GenerateNamePatch : OnPatcher
{
    public override bool AutoLoad => ModInstances.PathOfTerraria != null && TRuConfig.Instance.PathOfTerrariaLocalization && TranslationHelper.IsRussianLanguage;

    public override MethodInfo ModifiedMethod => typeof(GenerateName).FindMethod(nameof(GenerateName.Invoke));

    public override Delegate Delegate => Translation;
    
    private string Translation(Func<Item, string> orig, Item item)
    {
        PoTInstanceItemData data = item.GetInstanceData();
        PoTInstanceItemData.NameAffixes affixes = data.NameAffix;
        
        if (affixes.Prefix == -1)
        {
            string baseName = item.Name;
            string baseSuffix = affixes.Suffix == -1 ? string.Empty : " " + Language.GetTextValue($"Mods.PathOfTerraria.Gear.{data.ItemType}.Suffixes.{affixes.Suffix}");
            return baseName + baseSuffix;
        }
        
        string prefixKey = Language.GetTextValue($"Mods.PathOfTerraria.Gear.{data.ItemType}.Prefixes.{affixes.Prefix}");
        string genderedPrefix = prefixKey;
        
        foreach (var t in _prefixes.Where(t => t[0] == prefixKey))
        {
            genderedPrefix = PrefixOverhaul.Instance.GetGenderedPrefix(t, item.type);
        }
        
        string suffix = affixes.Suffix == -1 ? string.Empty : " " + Language.GetTextValue($"Mods.PathOfTerraria.Gear.{data.ItemType}.Suffixes.{affixes.Suffix}");
        
        return genderedPrefix + " " + item.Name.ToLower() + suffix;
    }

    private readonly List<string[]> _prefixes =
    [
        ["Выносливый", "Выносливая", "Выносливое", "Выносливые"],
        ["Грозный", "Грозная", "Грозное", "Грозные"],
        ["Драконий", "Драконья", "Драконье", "Драконьи"],
        ["Големовый", "Големовая", "Големовое", "Големовые"],
        ["Сторожевой", "Сторожевая", "Сторожевое", "Сторожевые"],
        ["Защищённый", "Защищённая", "Защищённое", "Защищённые"],
        ["Искусный", "Искусная", "Искусное", "Искусные"],
        ["Ветхий", "Ветхая", "Ветхое", "Ветхие"],
        ["Зачарованный", "Зачарованная", "Зачарованное", "Зачарованные"],
        ["Изящный", "Изящная", "Изящное", "Изящные"],
        ["Странный", "Странная", "Странное", "Странные"],
        ["Орлиный", "Орлиная", "Орлиное", "Орлиные"],
        ["Проворный", "Проворная", "Проворное", "Проворные"],
        ["Оперённый", "Оперённая", "Оперённое", "Оперённые"],
        ["Шипастый", "Шипастая", "Шипастое", "Шипастые"],
        ["Пряжковый", "Пряжковая", "Пряжковое", "Пряжковые"],
        ["Жестокий", "Жестокая", "Жестокое", "Жестокие"],
        ["Свирепый", "Свирепая", "Свирепое", "Свирепые"],
        ["Рассекающий", "Рассекающая", "Рассекающее", "Рассекающие"],
        ["Ратный", "Ратная", "Ратное", "Ратные"],
        ["Кровожадный", "Кровожадная", "Кровожадное", "Кровожадные"],
        ["Спиральный", "Спиральная", "Спиральное", "Спиральные"],
        ["Быстрый", "Быстрая", "Быстрое", "Быстрые"],
        ["Острый", "Острая", "Острое", "Острые"],
        ["Штормовой", "Штормовая", "Штормовое", "Штормовые"],
        ["Пронзающий", "Пронзающая", "Пронзающее", "Пронзающие"],
        ["Охотничий", "Охотничья", "Охотничье", "Охотничьи"],
        ["Шквальный", "Шквальная", "Шквальное", "Шквальные"],
        ["Мстительный", "Мстительная", "Мстительное", "Мстительные"],
        ["Чародейский", "Чародейская", "Чародейское", "Чародейские"],
        ["Мистический", "Мистическая", "Мистическое", "Мистические"],
        ["Жуткий", "Жуткая", "Жуткое", "Жуткие"],
        ["Светящийся", "Светящаяся", "Светящееся", "Светящиеся"],
        ["Сакральный", "Сакральная", "Сакральное", "Сакральные"],
        ["Гармоничный", "Гармоничная", "Гармоничное", "Гармоничные"],
        ["Блестящий", "Блестящая", "Блестящее", "Блестящие"],
        ["Запретный", "Запретная", "Запретное", "Запретные"],
        ["Древний", "Древняя", "Древнее", "Древние"],
        ["Святой", "Святая", "Святое", "Святые"],
        ["Зловещий", "Зловещая", "Зловещее", "Зловещие"],
        ["Опаляющий", "Опаляющая", "Опаляющее", "Опаляющие"],
        ["Ядовитый", "Ядовитая", "Ядовитое", "Ядовитые"],
        ["Зазубренный", "Зазубренная", "Зазубренное", "Зазубренные"],
        ["Огненный", "Огненная", "Огненное", "Огненные"],
        ["Громовой", "Громовая", "Громовое", "Громовые"],
        ["Обтекаемый", "Обтекаемая", "Обтекаемое", "Обтекаемые"],
        ["Мощный", "Мощная", "Мощное", "Мощные"],
        ["Отречённый", "Отречённая", "Отречённое", "Отречённые"],
        ["Проклятый", "Проклятая", "Проклятое", "Проклятые"],
        ["Гнусный", "Гнусная", "Гнусное", "Гнусные"],
        ["Ревнивый", "Ревнивая", "Ревнивое", "Ревнивые"],
        ["Закалённый", "Закалённая", "Закалённое", "Закалённые"],
        ["Потёртый", "Потёртая", "Потёртое", "Потёртые"],
        ["Благословенный", "Благословенная", "Благословенное", "Благословенные"],
        ["Укреплённый", "Укреплённая", "Укреплённое", "Укреплённые"],
        ["Великий", "Великая", "Великое", "Великие"],
        ["Жёсткий", "Жёсткая", "Жёсткое", "Жёсткие"],
        ["Закалённый в боях", "Закалённая в боях", "Закалённое в боях", "Закалённые в боях"],
        ["Украшенный", "Украшенная", "Украшенное", "Украшенные"],
        ["Грубый", "Грубая", "Грубое", "Грубые"],
        ["Зоркий", "Зоркая", "Зоркое", "Зоркие"],
        ["Мастерский", "Мастерская", "Мастерское", "Мастерские"],
        ["Потрёпанный", "Потрёпанная", "Потрёпанное", "Потрёпанные"],
        ["Эльфийский", "Эльфийская", "Эльфийское", "Эльфийские"],
        ["Призывающий", "Призывающая", "Призывающее", "Призывающие"],
        ["Заклинающий", "Заклинающая", "Заклинающее", "Заклинающие"],
        ["Связывающий", "Связывающая", "Связывающее", "Связывающие"],
        ["Полый", "Полая", "Полое", "Полые"],
        ["Расколотый", "Расколотая", "Расколотое", "Расколотые"],
        ["Прочный", "Прочная", "Прочное", "Прочные"],
        ["Закрепляющий", "Закрепляющая", "Закрепляющее", "Закрепляющие"],
        ["Улучшенный", "Улучшенная", "Улучшенное", "Улучшенные"],
        ["Сжатый", "Сжатая", "Сжатое", "Сжатые"],
        ["Заряженный", "Заряженная", "Заряженное", "Заряженные"],
        ["Безупречный", "Безупречная", "Безупречное", "Безупречные"],
        ["Утраченный", "Утраченная", "Утраченное", "Утраченные"],
        ["Вожделенный", "Вожделенная", "Вожделенное", "Вожделенные"],
        ["Забытый", "Забытая", "Забытое", "Забытые"],
        ["Призрачный", "Призрачная", "Призрачное", "Призрачные"],
        ["Пустой", "Пустая", "Пустое", "Пустые"],
        ["Взрывной", "Взрывная", "Взрывное", "Взрывные"],
        ["Удлинённый", "Удлинённая", "Удлинённое", "Удлинённые"],
        ["Громоздкий", "Громоздкая", "Громоздкое", "Громоздкие"],
        ["Снайперский", "Снайперская", "Снайперское", "Снайперские"],
        ["Покинутый", "Покинутая", "Покинутое", "Покинутые"],
        ["Ненавистный", "Ненавистная", "Ненавистное", "Ненавистные"],
        ["Презренный", "Презренная", "Презренное", "Презренные"]
    ];
}